app/controllers/bugs_controller.rb

SELECT "bugs".* FROM "bugs" ORDER BY CASE bugs.severity WHEN 'HIGH' THEN 'a' WHEN 'MEDIUM' THEN 'b' WHEN 'LOW' THEN 'c' ELSE 'z' END ASC, id ASC
---
  def index
    @bugs = Bug.all

SELECT "users".* FROM "users"
---
  def new
    @bug = Bug.new
    @users = User.all

INSERT INTO "bugs" ("title", "description", "state", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", ""], ["description", ""], ["state", ""], ["created_at", "2019-03-04 20:33:20.960413"], ["updated_at", "2019-03-04 20:33:20.960413"], ["user_id", 3]]
---
  def create
    @bug = Bug.new(bug_params)
    @bug.owner = current_user
    @bug.owner_bug = @bug.owner.username
    @bug.save

SELECT  "bugs".* FROM "bugs" WHERE "bugs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
  def edit
    @bug = Bug.find(params[:id])
    @users = User.all

SELECT  "bugs".* FROM "bugs" WHERE "bugs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bugs" SET "state" = $1, "severity" = $2, "updated_at" = $3 WHERE "bugs"."id" = $4  [["state", "open"], ["severity", "HIGH"], ["updated_at", "2019-03-05 02:33:12.089481"], ["id", 7]]
---
  def update
     @users = User.all
    @bug = Bug.find(params[:id])
    @bug.update(bug_params)