app/models/user.rb

  def self.find_for_database_authentication(warden_conditions)
    conditions = warden_conditions.dup
    if login = conditions.delete(:login)
      where(conditions.to_h).where(["lower(username) = :value OR lower(email) = :value", { :value => login.downcase }]).first
    elsif conditions.has_key?(:username) || conditions.has_key?(:email)
      where(conditions.to_h).first
---
SELECT  "users".* FROM "users" WHERE (lower(username) = 'bonjour' OR lower(email) = 'bonjour') ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE (lower(username) = 'emnaguellaty@gmail.com' OR lower(email) = 'emnaguellaty@gmail.com') ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE (lower(username) = 'emna' OR lower(email) = 'emna') ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]